Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus Security is also highly customizable. For more information, see the Quarkus xref:security-customization.adoc[Security tips and tricks] guide.
ja_jp: Quarkus Securityは、高度なカスタマイズも可能です。詳細については、Quarkus Securityの xref:security-customization.adoc[ヒントとトリック] ガイドを参照してください。

source: Quarkus Security is customizable. You can customize the following core security components of Quarkus:
ja_jp: Quarkus Security はカスタマイズ可能です。Quarkusの以下のコアセキュリティコンポーネントをカスタマイズできます：

source: Quarkus Security is highly customizable. One can register custom ``HttpAuthenticationMechanism``s, ``IdentityProvider``s and ``SecurityidentityAugmentor``s.
ja_jp: Quarkus Securityは、高度なカスタマイズが可能です。カスタム `HttpAuthenticationMechanism` 、 `IdentityProvider` 、 `SecurityidentityAugmentor` を登録することができます。

source: Quarkus Security is highly customizable. You can customize the following core security components of Quarkus:
ja_jp: Quarkus Securityは、高度にカスタマイズ可能です。Quarkusの以下のコアセキュリティコンポーネントをカスタマイズすることができます:

source: Quarkus Security overview
ja_jp: Quarkus Securityの概要

source: Quarkus Security provides a CSRF prevention feature which consists of a xref:resteasy-reactive.adoc[RESTEasy Reactive] server filter which creates and verifies CSRF tokens in 'application/x-www-form-urlencoded' and 'multipart/form-data' forms and a Qute HTML form parameter provider which supports the xref:qute-reference.adoc#injecting-beans-directly-in-templates[injection of CSRF tokens in Qute templates].
ja_jp: Quarkus Securityは、CSRF防止機能を提供しています。この機能は、'application/x-www-form-urlencoded' および 'multipart/form-data' フォームのCSRFトークンを作成および検証する link:resteasy-reactive.html[RESTEasy Reactive] サーバーフィルター、link:qute-reference.html#injecting-beans-directly-in-templates[Qute テンプレートへのCSRFトークン注入] をサポートするQute HTML form parameterプロバイダーからなります。

source: Quarkus Security provides a CSRF prevention feature which implements a https://cheatsheetseries.owasp.org/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.html#double-submit-cookie[Double Submit Cookie technique]. This techninque requires that the CSRF token is never directly exposed to scripts executed on the client-side. In this extension, the CSRF token is:
ja_jp: Quarkus Securityは、 link:https://cheatsheetseries.owasp.org/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.html#double-submit-cookie[Double Submit Cookieテクニック] を実装したCSRF防止機能を提供しています。この技術では、CSRFトークンがクライアントサイドで実行されるスクリプトに直接公開されないようにする必要があります。このエクステンションでは、CSRFトークンは、以下のようになります。

source: Quarkus Security provides a CSRF prevention feature which implements https://cheatsheetseries.owasp.org/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.html#double-submit-cookie[Double Submit Cookie] and <<csrf-request-header>> techniques.
ja_jp: Quarkus Security は、 link:https://cheatsheetseries.owasp.org/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.html#double-submit-cookie[Double Submit Cookie] と <<csrf-request-header>> テクニックを実装したCSRF防止機能を提供しています。

source: Quarkus Security provides a Quarkus REST (formerly RESTEasy Reactive) filter that can protect your applications against a https://owasp.org/www-community/attacks/csrf[Cross-Site Request Forgery] attack. For more information, see the Quarkus xref:security-csrf-prevention.adoc[Cross-Site Request Forgery Prevention] guide.
ja_jp: Quarkus Security は、 https://owasp.org/www-community/attacks/csrf[クロスサイトリクエストフォージェリー] 攻撃からアプリケーションを保護できる Quarkus REST (旧称 RESTEasy Reactive) フィルターを提供します。 詳細は、Quarkus xref:security-csrf-prevention.adoc[クロスサイトリクエストフォージェリー対策] ガイドを参照してください。

source: Quarkus Security provides a RESTEasy Reactive filter that can protect your applications against a https://owasp.org/www-community/attacks/csrf[Cross-Site Request Forgery] attack. For more information, see the Quarkus xref:security-csrf-prevention.adoc[Cross-Site Request Forgery Prevention] guide.
ja_jp: Quarkus Securityでは、 link:https://owasp.org/www-community/attacks/csrf[クロスサイトリクエストフォージェリ] 攻撃からアプリケーションを保護するRESTEasy Reactiveフィルタを提供しています。 詳細については、Quarkusの xref:security-csrf-prevention.adoc[クロスサイトリクエストフォージェリ対策] ガイドを参照してください。

source: Quarkus Security provides a RESTEasy Reactive filter that can protect your applications against a https://owasp.org/www-community/attacks/csrf[Cross-Site Request Forgery] attack. For more information, see xref:security-csrf-prevention.adoc[Cross-Site Request Forgery Prevention].
ja_jp: Quarkus Securityでは、 link:https://owasp.org/www-community/attacks/csrf[Cross-Site Request Forgery] 攻撃からアプリケーションを保護するRESTEasy Reactiveフィルタを提供しています。 詳細については、 xref:security-csrf-prevention.adoc[クロスサイトリクエストフォージェリ対策] を参照してください。

source: Quarkus Security provides an initial support for securing Jakarta Data Repositories with security annotations.
ja_jp: Quarkus Security は、セキュリティーアノテーションを使用して Jakarta Data リポジトリーを保護するための初期サポートを提供します。

source: Quarkus Security provides built-in authentication support for the xref:security-basic-authentication.adoc[Basic authentication].
ja_jp: Quarkus Security は、xref:security-basic-authentication.adoc[Basic 認証] の組み込み認証サポートを提供します。

source: Quarkus Security provides comprehensive OpenId Connect (OIDC) and OAuth2 support with its quarkus-oidc extension, supporting both Authorization code flow and Bearer token authentication mechanisms.
ja_jp: Quarkus Securityは、quarkus-oidcエクステンションによって、包括的なOpenId Connect（OIDC）とOAuth2のサポートを提供し、認可コードフローとベアラートークン認証メカニズムの両方をサポートします。

source: Quarkus Security provides the architecture, multiple authentication and authorization mechanisms, and other tools for the developers to build a production-quality security for their Quarkus applications.
ja_jp: Quarkus Securityでは、開発者がQuarkusアプリケーションの商用品質のセキュリティーを構築するためのアーキテクチャ、複数の認証および認可メカニズム、その他のツールを提供しています。

source: Quarkus Security provides the following built-in authentication support:
ja_jp: Quarkus Security には、次のような組込の認証サポートがあります:

source: Quarkus Security testing
ja_jp: Quarkus Securityのテスト

source: Quarkus Security uses `HttpAuthenticationMechanism` to extract the authentication credentials from the HTTP request and delegates them to `IdentityProvider` to convert the credentials to `SecurityIdentity`. For example, the credentials can come from the `Authorization` header, client HTTPS certificates, or cookies.
ja_jp: Quarkus Securityは、 `HttpAuthenticationMechanism` を使用してHTTPリクエストから認証クレデンシャルを抽出し、 `IdentityProvider` に委任して、認証クレデンシャルを `SecurityIdentity` に変換します。たとえば、クレデンシャルは、 `Authorization` ヘッダー、クライアントの HTTPS 証明書、または Cookie から取得することができます。

source: Quarkus Security uses a priority system to determine which mechanism gets the first chance to produce `SecurityIdentity`. The authentication mechanism priority affects the order of:
ja_jp: Quarkus Security は、どのメカニズムが最初に `SecurityIdentity` を生成する機会を得るかを決定するために、優先度システムを使用します。認証メカニズムの優先度は、次の順序に影響します。

source: Quarkus Security with Jakarta Persistence
ja_jp: Quarkus SecurityとJakarta Persistence

source: Quarkus Service Status
ja_jp: Quarkus サービスステータス

source: Quarkus Superheroes to the Rescue!
ja_jp: 手助けの為のQuarkus Superheroes!

source: Quarkus Testing Cheat Sheet
ja_jp: Quarkus Testing チートシート

source: Quarkus Tools for IntelliJ 1.10.0 released!
ja_jp: Quarkus Tools for IntelliJ 1.10.0リリース!

source: Quarkus Tools for IntelliJ 1.11.0 released!
ja_jp: Quarkus Tools for IntelliJ 1.11.0リリース!

source: Quarkus Tools for IntelliJ 1.3.0 released!
ja_jp: Quarkus Tools for IntelliJ 1.3.0 リリース!

source: Quarkus Tools for IntelliJ 1.4.0 released!
ja_jp: Quarkus Tools for IntelliJ 1.4.0 リリース!

source: Quarkus Tools for IntelliJ 1.8.0 released!
ja_jp: Quarkus Tools for IntelliJ 1.8.0 リリース!

source: Quarkus Tools for IntelliJ 1.9.0 released!
ja_jp: Quarkus Tools for IntelliJ 1.9.0 リリース!

source: Quarkus Tools for Visual Studio Code - 1.10.0 release
ja_jp: Visual Studio Code用Quarkus Tools - 1.10.0リリース

source: Quarkus Tools for Visual Studio Code 1.10.0 has been released on the https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[VS Code Marketplace] & https://open-vsx.org/extension/redhat/vscode-quarkus[Open VSX]. For a list of all changes, please refer to the https://github.com/redhat-developer/vscode-quarkus/blob/master/CHANGELOG.md[changelog].
ja_jp: Quarkus Tools for Visual Studio Code 1.10.0が link:https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[VS Code Marketplace] と link:https://open-vsx.org/extension/redhat/vscode-quarkus[Open VSX] でリリースされました。すべての変更点のリストについては、 link:https://github.com/redhat-developer/vscode-quarkus/blob/master/CHANGELOG.md[変更履歴]を参照してください。

source: Quarkus Tools for Visual Studio Code version 1.10.0 has been released on the https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[VS Code Marketplace] & https://open-vsx.org/extension/redhat/vscode-quarkus[Open VSX].
ja_jp: Quarkus Tools for Visual Studio Codeのバージョン1.10.0が link:https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[VS Code Marketplace] と link:https://open-vsx.org/extension/redhat/vscode-quarkus[Open VSX] でリリースされました。

source: Quarkus Tools for Visual Studio Code version 1.10.0 introduces its brand new Qute Templating Engine support.
ja_jp: Quarkus Tools for Visual Studio Codeのバージョン1.10.0では、新しいQute Templating Engineがサポートされています。

source: Quarkus Tools in Your Favorite IDE
ja_jp: お気に入りのIDEでQuarkusツール

source: Quarkus Tools in your favorite IDE
ja_jp: お好みのIDEのQuarkus Tools

source: Quarkus Tools now provides support for the https://docs.quarkiverse.io/quarkus-renarde/dev/index.html[Renarde] web framework:
ja_jp: Quarkus Toolsが link:https://docs.quarkiverse.io/quarkus-renarde/dev/index.html[Renarde] ウェブフレームワークをサポートするようになりました：

source: Quarkus Tools, and its dependencies used to require a JRE (Java Runtime Environment version 11 or newer) in order to run. This is because the language services are Java based. However, with recent updates, our underlying Java tooling support provides its own Java runtime on `win32-x64`, `linux-x64`, `linux-arm64`, `darwin-x64`, and `darwin-arm64`. This means if you’re on such a system, ensuring the extension can locate some version of Java 11 at a minimum is no longer necessary.
ja_jp: Quarkus Toolsとその依存関係を実行するには、以前はJRE（Java Runtime Environmentバージョン11以降）が必要でした。これは、言語サービスがJavaベースであるためです。しかし、最近のアップデートにより、私たちの基盤となるJavaツールサポートは、独自のJavaランタイムを `win32-x64`, `linux-x64`, `linux-arm64`, `darwin-x64`, および `darwin-arm64` で提供しています。つまり、このようなシステムを使用している場合、エクステンションがJava 11のいずれかのバージョンを検出できるようにする必要はありません。

source: Quarkus URL for `git clone` referenced by the documentation.
ja_jp: ドキュメントで参照されている `git clone` の Quarkus URL。

source: Quarkus URL for git clone referenced by the documentation.
ja_jp: ドキュメントで参照されている git clone の Quarkus URL。

source: Quarkus URL to main blob source tree; used for referencing source files.
ja_jp: ソースファイルを参照するために使用される、メインのブロブソースツリーへの Quarkus URL。

source: Quarkus URL to main source archive.
ja_jp: メインソースアーカイブへの Quarkus URL。

source: Quarkus URL to main source tree root; used for referencing directories.
ja_jp: メインソースツリールートへの Quarkus URL。

source: Quarkus URL to set of container images delivered for Quarkus.
ja_jp: Quarkus 用に配信されるコンテナーイメージのセットへの Quarkus URL。

source: Quarkus URL to the issues page.
ja_jp: Quarkus の課題ページへの URL。

source: Quarkus Usage Analytics
ja_jp: Quarkusの使用状況分析

source: Quarkus Vault to 4.7.0
ja_jp: Quarkus Vault を 4.7.0 に

source: Quarkus Version
ja_jp: Quarkus バージョン

source: Quarkus Virtual Thread support for gRPC services
ja_jp: Quarkusの仮想スレッドによるgRPCサービスのサポート

source: Quarkus Virtual Thread support with Reactive Messaging
ja_jp: Reactive MessagingによるQuarkus仮想スレッドのサポート

source: Quarkus WebSockets vs. Quarkus WebSockets Next
ja_jp: Quarkus WebSockets と Quarkus WebSockets Next

source: Quarkus World Tour - JUG Promotional Materials
ja_jp: Quarkus ワールドツアー - JUG プロモーション資料

source: Quarkus World Tour 2022 - The Road Never Ends
ja_jp: クオークス・ワールドツアー2022 ～ロード・ネバー・エンズ

source: Quarkus World Tour 2023
ja_jp: Quarkusワールドツアー2021

source: Quarkus World Tour Needs Your Help
ja_jp: Quarkus World Tourがあなたの助けを必要としています

source: Quarkus YAML configuration keys are implicitly escaped https://github.com/quarkusio/quarkus/issues/11744[#11744]
ja_jp: Quarkus YAML設定キーは暗黙のうちにエスケープされる link:https://github.com/quarkusio/quarkus/issues/11744[#11744]

source: Quarkus `web-app` applications always require the `quarkus.oidc.client-id` property.
ja_jp: Quarkus `web-app` アプリケーションには、常に `quarkus.oidc.client-id` プロパティーが必要です。

source: Quarkus adds a capability that CDI currently does not support which is to conditionally declare a bean if no other bean with equal types and qualifiers was declared by any available means (bean class, producer, synthetic bean, ...) This is done using the `@io.quarkus.arc.DefaultBean` annotation and is best explained with an example.
ja_jp: Quarkus は、CDI が現在サポートしていない機能を追加します。これは、利用可能な手段 (Beanクラス、producer、合成 Bean など) で同等の型と修飾子を持つ他の Bean が宣言されていない場合に、条件付きで Bean を宣言することです。これは、 `@io .quarkus.Arc.DefaultBean` アノテーションを使用して行われ、例を挙げて説明するのが最善です。

source: Quarkus adds a capability that CDI currently does not support which is to conditionally enable a bean when a Quarkus build time profile is enabled, via the `@io.quarkus.arc.profile.IfBuildProfile` and `@io.quarkus.arc.profile.UnlessBuildProfile` annotations. When used in conjunction with `@io.quarkus.arc.DefaultBean`, these annotations allow for the creation of different bean configurations for different build profiles.
ja_jp: Quarkus は、CDI が現在サポートしていない機能を追加しました。これは、Quarkus のビルドタイムプロファイルが有効になっているときに条件付きで Bean を有効にするというもので、 `@io.quarkus.arc.profile.IfBuildProfile` と `@io.quarkus.arc.profile.UnlessBuildProfile` のアノテーションを使用します。 `@io.quarkus.arc.DefaultBean` と合わせて使用すると、これらのアノテーションにより、異なるビルドプロファイルに対して異なる Bean 構成を作成することができます。

source: Quarkus adds a capability that CDI currently does not support which is to conditionally enable a bean when a Quarkus build time property has or does not have a specific value, via the `@io.quarkus.arc.properties.IfBuildProperty` and `@io.quarkus.arc.properties.UnlessBuildProperty` annotations. When used in conjunction with `@io.quarkus.arc.DefaultBean`, these annotations allow for the creation of different bean configurations for different build properties.
ja_jp: Quarkus は、CDI が現在サポートしていない機能を追加します。これは、Quarkus のビルド時のプロパティーに特定の値がある場合とない場合に、 `@io.quarkus.arc.properties.IfBuildProperty` および `@io.quarkus.arc.properties.UnlessBuildProperty` アノテーションを介して 条件付きで Bean を有効にする機能です。 これらのアノテーションを `@io.quarkus.arc.DefaultBean` と組み合わせて使用すると、異なるビルドプロパティーに対して異なる Bean 設定を作成できます。

source: Quarkus adds a capability that CDI currently does not support which is to conditionally enable a bean when a Quarkus build time property has/has not a specific value, via the `@io.quarkus.arc.properties.IfBuildProperty` and `@io.quarkus.arc.properties.UnlessBuildProperty` annotations. When used in conjunction with `@io.quarkus.arc.DefaultBean`, this annotation allow for the creation of different bean configurations for different build properties.
ja_jp: Quarkus には、CDI が現在サポートしていない機能が追加されています。それは、 `@io.quarkus.arc.properties.IfBuildProperty` と `@io.quarkus.arc.properties.UnlessBuildProperty` アノテーションを使用して、ビルドタイムプロパティーが特定の値であるかないときにBeanを条件付きで有効にするものです。このアノテーションを `@io.quarkus.arc.DefaultBean` と一緒に使用すると、ビルドプロパティーごとに異なるBean設定を作成することが可能になります。

source: Quarkus adds a capability that CDI currently does not support, which is to conditionally enable a bean when a Quarkus build time profile is enabled, via the `@io.quarkus.arc.profile.IfBuildProfile` and `@io.quarkus.arc.profile.UnlessBuildProfile` annotations. When used in conjunction with `@io.quarkus.arc.DefaultBean`, these annotations allow for the creation of different bean configurations for different build profiles.
ja_jp: Quarkus は、CDI が現在サポートしていない機能を追加します。これは、Quarkus のビルド時プロファイルが有効になっている場合に、`@io.quarkus.arc.profile.IfBuildProfile` および `@io.quarkus.arc.profile.UnlessBuildProfile` アノテーションを介して、条件付きで Bean を有効にするものです。これらのアノテーションを `@io.quarkus.arc.DefaultBean` と組み合わせて使用すると、異なるビルドプロファイルに対して異なる Bean 構成を作成できます。

source: Quarkus aids you on your journey to build reactive systems. Quarkus is based on a https://quarkus.io/version/main/guides/quarkus-reactive-architecture[reactive core]. Every Quarkus application is a reactive application. It uses the system resources efficiently and can handle large throughput. But, your code does not have to use reactive programming. You can mix and match three alternatives: plain imperative code, imperative code using virtual threads, or reactive code. Depending on your requirements, you will pick one or another or even mix them.
ja_jp: Quarkus は、リアクティブ システムを構築する道程を支援します。Quarkus は https://quarkus.io/version/main/guides/quarkus-reactive-architecture[リアクティブ コア] に基づいています。すべての Quarkus アプリケーションはリアクティブ アプリケーションです。システム リソースを効率的に使用し、大きなスループットを処理できます。ただし、コードでリアクティブ プログラミングを使用する必要はありません。プレーンな命令型コード、仮想スレッドを使用する命令型コード、リアクティブ コードの 3 つの選択肢を組み合わせて使用​​できます。要件に応じて、いずれか 1 つを選択するか、またはそれらを組み合わせることもできます。

source: Quarkus aids you on your journey to reactive. Quarkus is based on a <a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">reactive core</a> allowing your application to mix reactive and imperative components. As an example, you can implement reactive HTTP endpoint using the <a href="https://quarkus.io/guides/resteasy-reactive">RESTEasy Reactive extension</a> as follows:
ja_jp: Quarkusは、リアクティブへの道のりをサポートします。Quarkusは、<a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">リアクティブコア</a>をベースにしており、アプリケーションにリアクティブ型コンポーネントと命令型コンポーネントを混在させることができます。例として、<a href="https://quarkus.io/guides/resteasy-reactive">RESTEasy Reactive エクステンション</a>を使用して、以下のようにリアクティブなHTTPエンドポイントを実装できます。

source: Quarkus allows different beans to interact using asynchronous events, thus promoting loose-coupling. The messages are sent to _virtual addresses_. It offers 3 types of delivery mechanism:
ja_jp: Quarkusでは、異なる Bean が非同期イベントを使用して相互作用することができるため、疎結合化が促進されます。メッセージは _仮想アドレス_ に送信されます。3種類の配信メカニズムを提供しています。

source: Quarkus allows users to arbitrarily customize the options of HTTP servers started by Quarkus via the use of `io.quarkus.vertx.http.HttpServerOptionsCustomizer`. For example, if the HTTP port needs to be set programmatically, then the following code could be used:
ja_jp: Quarkusでは、 `io.quarkus.vertx.http.HttpServerOptionsCustomizer` を使用して、Quarkusが起動するHTTPサーバーのオプションを任意にカスタマイズできます。 例えば、HTTPポートをプログラムで設定する必要がある場合、次のコードを使用できます:

source: Quarkus allows you to define conditions evaluated at build time (`@IfBuildProfile`, `@UnlessBuildProfile`, `@IfBuildProperty` and `@UnlessBuildProperty`) to enable or not the annotations `@ConfigProperties` and `@ConfigPrefix` which gives you a very flexible way to map your configuration.
ja_jp: Quarkusでは、ビルド時に評価される条件（ `@IfBuildProfile` 、 `@UnlessBuildProfile` 、 `@IfBuildProperty` 、 `@UnlessBuildProperty` ）を定義して、アノテーション `@ConfigProperties` と `@ConfigPrefix` を有効にしたり、無効にしたりすることができ、構成を非常に柔軟にマッピングすることができます。

source: Quarkus already knows how to create a native executable using GraalVM Native Image. The default setup will create a single executable file following a naming convention. However the JReleaser tool expects a distribution that is, a conventional file structure packaged as a Zip or Tar file. The file structure must follow this layout:
ja_jp: Quarkusは、GraalVM Native Imageを使用してネイティブ実行可能ファイルを作成する方法をすでに知っています。デフォルトの設定では、命名規則に従って1つの実行可能ファイルが作成されます。しかし、JReleaserツールは、ZipまたはTarファイルとしてパッケージ化された従来のファイル構造であるディストリビューションを期待しています。ファイル構造は以下のようなレイアウトになっている必要があります。

source: Quarkus already knows how to create a native executable using GraalVM Native Image. The default setup will create a single executable file following a naming convention. However, the JReleaser tool expects a distribution that is, a conventional file structure packaged as a Zip or Tar file. The file structure must follow this layout:
ja_jp: Quarkusは、GraalVM Native Imageを使用してネイティブ実行可能ファイルを作成する方法をすでに知っています。デフォルトの設定では、命名規則に従って1つの実行ファイルが作成されます。しかし、JReleaserツールは、ZipまたはTarファイルとしてパッケージ化された従来のファイル構造であるディストリビューションを期待しています。ファイル構造は以下のようなレイアウトになっている必要があります:

source: Quarkus also contains a WebSocket client. You can call `ContainerProvider.getWebSocketContainer().connectToServer` to create a websocket connection. By default the `quarkus-websockets` artifact includes both client and server support however if you only want the client you can include `quarkus-websockets-client` instead.
ja_jp: Quarkusには、WebSocketクライアントも含まれています。 `ContainerProvider.getWebSocketContainer().connectToServer` を呼び出して、WebSocket 接続を作成できます。デフォルトでは、 `quarkus-websockets` アーティファクトにはクライアントとサーバーの両方が含まれていますが、クライアントのみを必要とする場合は、代わりに `quarkus-websockets-client` を含めることができます。

source: Quarkus also contains a WebSocket client. You can call `ContainerProvider.getWebSocketContainer().connectToServer` to create a websocket connection. By default, the `quarkus-websockets` artifact includes both client and server support. However, if you only want the client you can include `quarkus-websockets-client` instead.
ja_jp: Quarkusには、WebSocketクライアントも含まれています。 `ContainerProvider.getWebSocketContainer().connectToServer` を呼び出して、WebSocket 接続を作成できます。デフォルトでは、 `quarkus-websockets` アーティファクトにはクライアントとサーバーの両方が含まれていますが、クライアントのみを必要とする場合は、代わりに `quarkus-websockets-client` を含めることができます。

source: Quarkus also offers a programmatic API which can be used to store, retrieve or delete values from any cache declared using the annotations API. All operations from the programmatic API are non-blocking and rely on https://smallrye.io/smallrye-mutiny/[Mutiny] under the hood.
ja_jp: Quarkusは、アノテーションAPIを使用して宣言された任意のキャッシュから値を保存、取得、削除するために使用できるプログラムAPIも提供しています。プログラムAPIからのすべての操作はノンブロッキングで、フードの下で https://smallrye.io/smallrye-mutiny/[Mutiny] に依存しています。

source: Quarkus also provides RestAssured integration that updates the default port used by RestAssured before the tests are run, so no additional configuration should be required.
ja_jp: Quarkusはまた、テストを実行する前にRestAssuredによって使用されるデフォルトのポートを更新するRestAssuredインテグレーションも提供しているため、 追加の設定は必要ありません。

source: Quarkus also provides support for injecting configuration values using Spring's `@Value` annotation. To see that in action, first edit the `src/main/resources/application.properties` with the following content:
ja_jp: Quarkusは、Springの `@Value` アノテーションを使用して設定値を注入するサポートも提供しています。動作を確認するには、まず、以下の内容で `src/main/resources/application.properties` を編集します:

source: Quarkus also provides the `io.quarkus.security.PermissionsAllowed` annotation, which authorizes any authenticated user with the given permission to access the resource. This annotation is an extension of the common security annotations and checks the permissions granted to a `SecurityIdentity` instance.
ja_jp: Quarkus は、指定された権限を持つ認証済みユーザーにリソースへのアクセスを認可する `io.quarkus.security.PermissionsAllowed` アノテーションも提供します。 このアノテーションは、一般的なセキュリティーアノテーションのエクステンションであり、 `SecurityIdentity` インスタンスに付与された権限をチェックします。

source: Quarkus also provides the xref:deploying-to-openshift.adoc[OpenShift] extension. This extension is basically a wrapper around the Kubernetes extension and relieves OpenShift users of the necessity of setting the `deployment-target` property to `openshift`
ja_jp: Quarkus は xref:deploying-to-openshift.adoc[OpenShift] エクステンションも提供しています。このエクステンションは、基本的に Kubernetes エクステンションのラッパーであり、これにより、OpenShift ユーザーは `deployment-target` プロパティーを `openshift` に設定する必要がなくなります。

source: Quarkus also supports https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] so, if you prefer JSON-B over Jackson, you can create a project relying on the Quarkus REST JSON-B extension instead:
ja_jp: Quarkusは link:https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] もサポートしているため、JacksonよりもJSON-Bを好む場合は、代わりにQuarkus REST JSON-Bエクステンションに依存するプロジェクトを作成できます：
